# Selecting data in a data frame

In [4]:
#import the pandas library and aliasing as pd
import pandas as pd

In [5]:
#create dictionary 'x' with keys 'Name' 'ID' and 'Salary'

x = {'Name':['Rose', 'John', 'Jane', 'Mary'], 'ID':[1,2,3,4], 'Salary':[10000,80000,50000,60000]}

#cast the dictionary to a dataframe
df = pd.DataFrame(x)

#display the dataframe
df

   Name  ID  Salary
0  Rose   1   10000
1  John   2   80000
2  Jane   3   50000
3  Mary   4   60000

## Column Selection:

In [6]:
#retrieve the ID column & assign it to a new dataframe df2

df2 = df[['ID']]

df2

   ID
0   1
1   2
2   3
3   4

In [7]:
#what type is the new dataframe (df2)
type(df2)

pandas.core.frame.DataFrame

In [8]:
#retrieve multiple columns and assign to a new dataframe df3
df3 = df[['Name', 'Salary']]
df3

   Name  Salary
0  Rose   10000
1  John   80000
2  Jane   50000
3  Mary   60000

In [9]:
#create a dictionary with keys 'Student' 'Age' 'Country' 'Course' and 'Marks'
y = {'Student':['Rose', 'John', 'Jane', 'Mary'], 'Age':[20, 30, 25, 28], 'Country':['Kenya', 'Uganda', 'Tanzania', 'Rwanda'], 'Course':['Math', 'Science', 'English', 'History'], 'Marks':[90, 80, 70, 60]}
#cast the dictionary to a dataframe
df4 = pd.DataFrame(y)
#display the dataframe
df4

  Student  Age   Country   Course  Marks
0    Rose   20     Kenya     Math     90
1    John   30    Uganda  Science     80
2    Jane   25  Tanzania  English     70
3    Mary   28    Rwanda  History     60

In [10]:
#retrieve the marks column and assign it to variable b
b = df4[['Marks']]
#display the variable b
b

   Marks
0     90
1     80
2     70
3     60

In [11]:
#retrieve the Country and Course columns and assign to variable c
c = df4[['Country', 'Course']]
#display the variable c
c

    Country   Course
0     Kenya     Math
1    Uganda  Science
2  Tanzania  English
3    Rwanda  History

In [12]:
#display a column in df1 as a series (use just one square bracket)
s = df4['Student']
s

0    Rose
1    John
2    Jane
3    Mary
Name: Student, dtype: object

In [13]:
#what type is the variable s
type(s)

pandas.core.series.Series

`.loc()` - location based on label (row or column name) 
loc[row_label, col_label]
`.iloc()` - location based on index
iloc[row_index, col_index]

In [14]:
#first row first column
df.iloc[0,0]

#first row third column
df.iloc[0,2]

#access col using name
df.loc[0, 'Salary']

10000

### Change the index to a an identifier column's contents

In [15]:
#create a new df, assign the original df to it, then change the index to the Name column
df5 = df
df5.set_index('Name', inplace=True)

#display first 5 rows of df5
df5.head()

      ID  Salary
Name
Rose   1   10000
John   2   80000
Jane   3   50000
Mary   4   60000

In [16]:
#can use name now to access columns
df5.loc['Rose', 'Salary']

10000

# Slicing 
Use []
rows: data[index_start:index_after_stop]
give the index of the first row you want included: the index after the last row you want included

indexing by labels(i.e. using `loc()`) differs from indexing by integers (i.e. using `iloc()`). 

With `loc()`, both the start bound and the stop bound are inclusive. When using `loc()`, integers can be used, but the integers refer to the index label and not the position.

For example, using `loc()` and select 1:4 will get a different result than using `iloc()` to select rows 1:4.

e.g. `d5.loc('Rose':'Jane', 'Salary') will include both Rose and Jane and anything between:
Name
Rose    10000
John    80000
Jane    50000

In [17]:
# is inclusive of both Rose and Jane
df5.loc['Rose':'Jane', 'Salary']

Name
Rose    10000
John    80000
Jane    50000
Name: Salary, dtype: int64

In [19]:
# Does not include Jane (index 2)
df4.iloc[0:2]

  Student  Age Country   Course  Marks
0    Rose   20   Kenya     Math     90
1    John   30  Uganda  Science     80